//VALRUN1 JOB 1,NOTIFY=&SYSUID,MSGCLASS=H,CLASS=A                       00010000
//RUN  EXEC PGM=VALID1                                                  00020000
//STEPLIB DD DSN=&SYSUID..LOAD,DISP=SHR                                 00030000
//INFILE  DD DSN=&SYSUID..COBOL.DATA2(TGMASTER),DISP=SHR                00040000
//OUTFILE DD DSN=&SYSUID..COBOL.OUTPUTS(VALIDRPT),DISP=SHR              00050000
//GOOD DD DSN=&SYSUID..COBOL.DATA2(VALID),DISP=SHR                      00050000
//BAD DD DSN=&SYSUID..COBOL.DATA2(BAD),DISP=SHR                         00050000
